laravel/app/Http/Controllers/FileController.php

    public function index()
    {
        //


        return view("files.index",[
            "files" => File::all()
        ]);
---
select * from `files`

    public function update(Request $request, File $file)
    {

     /*    $request->validate([

            'upload' => 'required|mimes:gif,jpeg,jpg,png|max:1024'
        ]);



        $file->update($request->all());

        return redirect()->route('files.index')
                        ->with('success','Product updated successfully');
---
update `files` set `upload` = '{}', `files`.`updated_at` = '2022-04-04 14:03:21' where `id` = 1
select * from `files` where `files`.`id` in (1, '2022-03-21T16:21:29.000000Z', '2022-03-21T16:21:29.000000Z')